hdscmcu/hc32f120/驱动库及样例/hc32f120_ddl/driver/src/hc32f120_efm.c
/**
 *******************************************************************************
 * @file  hc32f120_efm.c
 * @brief This file provides firmware functions to manage the Embedded Flash
 *        Management unit (EFM).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2019-05-06       Chengy          First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co., Ltd. ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f120_efm.h"
#include "hc32f120_utility.h"

/**
 * @addtogroup HC32F120_DDL_Driver
 * @{
 */

/**
 * @defgroup DDL_EFM EFM
 * @brief Embedded Flash Management Driver Library
 * @{
 */

#if (DDL_EFM_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup EFM_Local_Macros EFM Local Macros
 * @{
 */

/**
 * @defgroup EFM_Check_Parameters_Validity EFM Check Parameters Validity
 * @{
 */
/*  Parameter validity check for pointer. */
#define IS_VALID_POINTER(x)                     (NULL != (x))

/*  Parameter validity check for flash latency. */
#define IS_VALID_EFM_LATENCY(latency)                                          \
(       ((latency) == EFM_LATENCY_0)            ||                             \
        ((latency) == EFM_LATENCY_1))

/*  Parameter validity check for operate mode. */
#define IS_VALID_EFM_OPERATE_MD(MD)                                            \
(       ((MD) == EFM_MODE_PROGRAMSINGLE)        ||                             \
        ((MD) == EFM_MODE_PROGRAMREADBACK)      ||                             \
        ((MD) == EFM_MODE_PROGRAMSEQUENCE)      ||                             \
        ((MD) == EFM_MODE_ERASESECTOR)          ||                             \
        ((MD) == EFM_MODE_ERASECHIP)            ||                             \
        ((MD) == EFM_MODE_READONLY)             ||                             \
        ((MD) == EFM_MODE_READONLY1)            ||                             \
        ((MD) == EFM_MODE_READONLY2))

/*  Parameter validity check for flash interrupt select. */
#define IS_VALID_EFM_INT_SEL(SEL)                                              \
(       ((SEL) == EFM_INT_EOP)                  ||                             \
        ((SEL) == EFM_INT_PEERR)                ||                             \
        ((SEL) == EFM_INT_RDCOLERR))

/*  Parameter validity check for flash flag. */
#define IS_VALID_EFM_FLAG(flag)                                                \
(       ((flag) == EFM_FLAG_PEWERR)             ||                             \
        ((flag) == EFM_FLAG_PEPRTERR)           ||                             \
        ((flag) == EFM_FLAG_PGMISMTCHERR)       ||                             \
        ((flag) == EFM_FLAG_OPTEND)             ||                             \
        ((flag) == EFM_FLAG_COLERR)             ||                             \
        ((flag) == EFM_FLAG_RDY))

/*  Parameter validity check for bus state while flash program or erase. */
#define IS_VALID_EFM_BUS_STATE(state)                                          \
(       ((state) == EFM_BUS_BUSY)               ||                             \
        ((state) == EFM_BUS_RELEASE))

/*  Parameter validity check for efm instruction cache state. */
#define IS_VALID_EFM_INSCACHE_STATE(state)                                     \
(       ((state) == EFM_INSCACHE_ON)            ||                             \
        ((state) == EFM_INSCACHE_OFF))


#define IS_VALID_EFM_ADDR(addr)                                                \
(       ((addr) == EFM_START_ADDR)              ||                             \
        ((addr) >= (EFM_START_ADDR + 1))        &&                             \
        ((addr) <= EFM_END_ADDR))

/**
 * @}
 */

/**
 * @}
 */

