hdscmcu/hc32f120/驱动库及样例/hc32f120_ddl/driver/src/hc32f120_efm.c
/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup EFM_Global_Functions EFM Global Functions
 * @{
 */

/**
 * @brief  EFM unlock.
 * @param  None
 * @retval None
 */
void EFM_Unlock(void)
{
    M0P_EFM->FAPRT = EFM_KEY1;
    M0P_EFM->FAPRT = EFM_KEY2;
}
/**
 * @brief  EFM Lock.
 * @param  None
 * @retval None
 */
void EFM_Lock(void)
{
    M0P_EFM->FAPRT = 0x00001111U;
}

/**
 * @brief  Enable or disable EFM.
 * @param  [in] enNewState                The function new state.
 *   @arg  This parameter can be: Enable or Disable.
 * @retval None
 */
void EFM_Cmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    M0P_EFM->FSTP = ((Enable == enNewState) ? EFM_ON : EFM_OFF);
}

/**
 * @brief  Init efm config structure with default value.
 * @param  [in] pstcEfmCfg         The pointer of efm config structure.
 *   @arg u32Latency    Specifies the efm latency.
 *   @arg u32InsCache   Specifies the instruction cache on or off.
 *   @arg u32BusState   Specifies the bus state busy or release while program & erase.
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t EFM_StrucInit(stc_efm_cfg_t *pstcEfmCfg)
{
    en_result_t enRet = Ok;

    /* Check if pointer is NULL */
    if (NULL == pstcEfmCfg)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Configure to default value */
        pstcEfmCfg->u32Latency  = EFM_LATENCY_1;
        pstcEfmCfg->u32InsCache = EFM_INSCACHE_OFF;
        pstcEfmCfg->u32BusState = EFM_BUS_BUSY;
    }

    return enRet;
}

/**
 * @brief  Config efm.
 * @param  [in] pstcEfmCfg         The pointer of efm config structure.
 *   @arg u32Latency    Specifies the efm latency.
 *   @arg u32InsCache   Specifies the instruction cache on or off.
 *   @arg u32BusState   Specifies the bus state busy or release while program & erase.
 * @retval An en_result_t enumeration value:
 *           - Ok: Configure success
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t EFM_Config(const stc_efm_cfg_t *pstcEfmCfg)
{
    en_result_t enRet = Ok;

    /* Check if pointer is NULL */
    if (NULL == pstcEfmCfg)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Param valid check */
        DDL_ASSERT(IS_VALID_EFM_LATENCY(pstcEfmCfg->u32Latency));
        DDL_ASSERT(IS_VALID_EFM_BUS_STATE(pstcEfmCfg->u32BusState));
        DDL_ASSERT(IS_VALID_EFM_INSCACHE_STATE(pstcEfmCfg->u32InsCache));

        /* Config efm. */
        MODIFY_REG(M0P_EFM->FRMC, EFM_FRMC_FLWT | EFM_FRMC_PREFETE,
                pstcEfmCfg->u32Latency | pstcEfmCfg->u32InsCache);
        MODIFY_REG(M0P_EFM->FWMC, EFM_FWMC_BUSHLDCTL, pstcEfmCfg->u32BusState);
    }

    return enRet;
}

/**
 * @brief  Set the code latency value.
 * @param  [in] u32Latency              specifies the FLASH Latency value.
 *  This parameter can be one of the following values:
 *   @arg    EFM_LATENCY_0               FLASH 0 Latency cycle
 *   @arg    EFM_LATENCY_1               FLASH 1 Latency cycle
 * @retval None
 */
void EFM_SetLatency(uint32_t u32Latency)
{
    /* Param valid check */
    DDL_ASSERT(IS_VALID_EFM_LATENCY(u32Latency));

    /* Set the code latency value. */
    MODIFY_REG(M0P_EFM->FRMC, EFM_FRMC_FLWT, u32Latency);
}

/**
 * @brief  Enable or disable the flash instruction cache.
 * @param  [in] enNewState                The new state of the flash instruction cache.
 *   @arg  This parameter can be: Enable or Disable.
 * @retval None
 */
void EFM_InstructionCacheCmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if(Enable == enNewState)
    {
        SET_BIT(M0P_EFM->FRMC, EFM_FRMC_PREFETE);
    }
    else
    {
        CLEAR_BIT(M0P_EFM->FRMC, EFM_FRMC_PREFETE);
    }
}

/**
 * @brief  Checks whether the specified FLASH flag is set or not..
 * @param  [in] u32PeMode                Specifies the FLASH flag to check.
 *  This parameter can be one of the following values:
 *   @arg  EFM_MODE_PROGRAMSINGLE           Program single at a specified address
 *   @arg  EFM_MODE_PROGRAMREADBACK         Program and read back at a specified address
 *   @arg  EFM_MODE_PROGRAMSEQUENCE         Program sequence at sequence address
 *   @arg  EFM_MODE_ERASESECTOR             Sector erase
 *   @arg  EFM_MODE_ERASECHIP               Chip erase
 *   @arg  EFM_MODE_READONLY                Read only
 *   @arg  EFM_MODE_READONLY1               Read only
 *   @arg  EFM_MODE_READONLY2               Read only
 * @retval None
 */
void EFM_SetOperateMode(uint32_t u32PeMode)
{
    DDL_ASSERT(IS_VALID_EFM_OPERATE_MD(u32PeMode));

    /* Enable operate mode modified. */
    SET_BIT(M0P_EFM->FWMC, EFM_FWMC_PEMODE);
    /* Set the program or erase mode. */
    MODIFY_REG(M0P_EFM->FWMC, EFM_FWMC_PEMOD, u32PeMode);
    /* Disable operate mode modified. */
    CLEAR_BIT(M0P_EFM->FWMC, EFM_FWMC_PEMODE);
}

/**
 * @brief  Enable or Disable EFM interrupt.
 * @param  [in] u32EfmInt               Specifies the FLASH flag to check.
 *  This parameter can be one of the following values:
 *   @arg  EFM_INT_EOP                  End of EFM Operation Interrupt source
 *   @arg  EFM_INT_PEERR                Program/erase error Interrupt source
 *   @arg  EFM_INT_RDCOLERR             Read collide error Interrupt source
 * @param  [in] enNewState              The new state of specified interrupt.
 *  This parameter can be: Enable or Disable.
 * @retval None
 */
void EFM_InterruptCmd(uint32_t u32EfmInt, en_functional_state_t enNewState)
{
    uint8_t u8state;

    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    DDL_ASSERT(IS_VALID_EFM_INT_SEL(u32EfmInt));

    u8state = ((Enable == enNewState) ? 1u : 0u);

    switch(u32EfmInt)
    {
        case EFM_INT_EOP:
            MODIFY_REG(M0P_EFM->FITE, EFM_FITE_OPTENDITE, u8state);
            break;
        case EFM_INT_PEERR:
            MODIFY_REG(M0P_EFM->FITE, EFM_FITE_PEERRITE, u8state);
            break;
        case EFM_INT_RDCOLERR:
            MODIFY_REG(M0P_EFM->FITE, EFM_FITE_RDCOLERRITE, u8state);
            break;
        default:
            break;
    }
}

/**
 * @brief  Checks whether the specified FLASH flag is set or not.
 * @param  [in] u32flag                  Specifies the FLASH flag to check.
 *  This parameter can be one of the following values:
 *   @arg  EFM_FLAG_PEWERR               Flash wirte protect error flag.
 *   @arg  EFM_FLAG_PEPRTERR             Flash program protect area error flag.
 *   @arg  EFM_FLAG_PGMISMTCHERR         Flash program miss match flag.
 *   @arg  EFM_FLAG_OPTEND               Flash end of program flag.
 *   @arg  EFM_FLAG_COLERR               Flash read write error flag.
 *   @arg  EFM_FLAG_RDY                  Flash ready flag.
 * @retval An en_flag_status_t enumeration value:
 *           - Set: Interrupt flag is set
 *           - Reset: Interrupt flag is reset
 */
en_flag_status_t EFM_GetFlagStatus(uint32_t u32flag)
{
    DDL_ASSERT(IS_VALID_EFM_FLAG(u32flag));

    return ((0ul == (M0P_EFM->FSR & u32flag)) ? Reset :Set);
}

/**
 * @brief  Clear the flash flag.
 * @param  [in] u32flag                  Specifies the FLASH flag to clear.
 *  This parameter can be one of the following values:
 *   @arg  EFM_FLAG_CLR_PEWERRCLR        Flash wirte protect error flag.
 *   @arg  EFM_FLAG_CLR_PEPRTERRCLR      Flash program protect area error flag.
 *   @arg  EFM_FLAG_CLR_PGMISMTCHCLR     Flash program miss match flag.
 *   @arg  EFM_FLAG_CLR_OPTENDCLR        Flash end of program flag.
 *   @arg  EFM_FLAG_CLR_COLERRCLR         Flash read write error flag.
 * @retval None
 */
void EFM_ClearFlag(uint32_t u32flag)
{
    SET_BIT(M0P_EFM->FSCLR, u32flag);
}

/**
 * @brief  Set flash protect area.
 * @param  [in] stcAddr                  Specifies the FLASH protect area.
 *   @arg  u32StartAddr                     Start address of protect area.
 *   @arg  u32EndAddr                       End address of protect area.
 * @retval None
 */
void EFM_SetWinProtectAddr(stc_efm_win_protect_addr_t stcAddr)
{
    /* Set protect area start address */
    MODIFY_REG(M0P_EFM->FPMTSW, EFM_FPMTSW_FPMTSW, stcAddr.u32StartAddr);
    /* Set protect area end address */
    MODIFY_REG(M0P_EFM->FPMTEW, EFM_FPMTEW_FPMTEW, stcAddr.u32EndAddr);
}

/**
 * @brief  Set bus state while flash program or erase.
 * @param  [in] u32State                  Specifies the new bus state while flash program or erase.
 *  This parameter can be one of the following values:
 *   @arg  EFM_BUS_BUSY                   Bus busy while flash program or erase.
 *   @arg  EFM_BUS_RELEASE                Bus releas while flash program or erase.
 * @retval None
 */
void EFM_SetBusState(uint32_t u32State)
{
    DDL_ASSERT(IS_VALID_EFM_BUS_STATE(u32State));

    MODIFY_REG(M0P_EFM->FWMC, EFM_FWMC_BUSHLDCTL, u32State);
}

/**
 * @brief  Flash single program word without read back.
 * @param  [in] u32Addr                   The specified program address.
 * @param  [in] u32Data                   The specified program data.
 * @retval An en_result_t enumeration value:
 *           - Ok: program success
 *           - Error: program error
 *           - ErrorTimeout: program error timeout
 */
en_result_t EFM_ProgramWord(uint32_t u32Addr, uint32_t u32Data)
{
    en_result_t enRet = Ok;
    uint16_t u16tmp = 0u;

    DDL_ASSERT(IS_VALID_EFM_ADDR(u32Addr));

    /* CLear the error flag. */
    EFM_ClearFlag(EFM_FLAG_CLR_PEWERRCLR    | EFM_FLAG_CLR_PEPRTERRCLR |
                  EFM_FLAG_CLR_PGMISMTCHCLR | EFM_FLAG_CLR_OPTENDCLR   |
                  EFM_FLAG_CLR_COLERRCLR);

    /* Set single program mode. */
    EFM_SetOperateMode(EFM_MODE_PROGRAMSINGLE);
    /* program data. */
    *(uint32_t*)u32Addr = u32Data;

    while(Set != EFM_GetFlagStatus(EFM_FLAG_RDY))
    {
        u16tmp ++;
        if(u16tmp > EFM_TIMEOUT)
        {
            enRet = ErrorTimeout;
        }
    }

    if(u32Data != *(uint32_t*)u32Addr)
    {
        enRet = Error;
    }

    EFM_ClearFlag(EFM_FLAG_CLR_OPTENDCLR);
    /* Set read only mode. */
    EFM_SetOperateMode(EFM_MODE_READONLY);

    return enRet;
}

/**
 * @brief  Flash single program half word without read back.
 * @param  [in] u32Addr                   The specified program address.
 * @param  [in] u16Data                   The specified program data.
 * @retval An en_result_t enumeration value:
 *           - Ok: program success
 *           - Error: program error
 *           - ErrorTimeout: program error timeout
 */
en_result_t EFM_ProgramHalfWord(uint32_t u32Addr, uint16_t u16Data)
{
    en_result_t enRet = Ok;
    uint16_t u16tmp = 0u;

    DDL_ASSERT(IS_VALID_EFM_ADDR(u32Addr));

    /* CLear the error flag. */
    EFM_ClearFlag(EFM_FLAG_CLR_PEWERRCLR    | EFM_FLAG_CLR_PEPRTERRCLR |
                  EFM_FLAG_CLR_PGMISMTCHCLR | EFM_FLAG_CLR_OPTENDCLR   |
                  EFM_FLAG_CLR_COLERRCLR);

    /* Set single program mode. */
    EFM_SetOperateMode(EFM_MODE_PROGRAMSINGLE);
    /* program data. */
    *((volatile uint16_t*)u32Addr) = u16Data;

    while(Set != EFM_GetFlagStatus(EFM_FLAG_RDY))
    {
        u16tmp ++;
        if(u16tmp > EFM_TIMEOUT)
        {
            enRet = ErrorTimeout;
        }
    }

    if(u16Data != *((volatile uint16_t*)u32Addr))
    {
        enRet = Error;
    }

    EFM_ClearFlag(EFM_FLAG_CLR_OPTENDCLR);
    /* Set read only mode. */
    EFM_SetOperateMode(EFM_MODE_READONLY);

    return enRet;
}

/**
 * @brief  Flash single program byte without read back.
 * @param  [in] u32Addr                   The specified program address.
 * @param  [in] u8Data                    The specified program data.
 * @retval An en_result_t enumeration value:
 *           - Ok: program success
 *           - Error: program error
 *           - ErrorTimeout: program error timeout
 */
en_result_t EFM_ProgramByte(uint32_t u32Addr, uint8_t u8Data)
{
    en_result_t enRet = Ok;
    uint16_t u16tmp = 0u;

    DDL_ASSERT(IS_VALID_EFM_ADDR(u32Addr));

    /* CLear the error flag. */
    EFM_ClearFlag(EFM_FLAG_CLR_PEWERRCLR    | EFM_FLAG_CLR_PEPRTERRCLR |
                  EFM_FLAG_CLR_PGMISMTCHCLR | EFM_FLAG_CLR_OPTENDCLR   |
                  EFM_FLAG_CLR_COLERRCLR);

    /* Set single program mode. */
    EFM_SetOperateMode(EFM_MODE_PROGRAMSINGLE);
    /* program data. */
    *((volatile uint8_t*)u32Addr) = u8Data;

    while(Set != EFM_GetFlagStatus(EFM_FLAG_RDY))
    {
        u16tmp ++;
        if(u16tmp > EFM_TIMEOUT)
        {
            enRet = ErrorTimeout;
        }
    }

