hdscmcu/hc32f120/驱动库及样例/hc32f120_ddl/driver/src/hc32f120_efm.c
    if(u8Data != *((volatile uint8_t*)u32Addr))
    {
        enRet = Error;
    }

    EFM_ClearFlag(EFM_FLAG_CLR_OPTENDCLR);
    /* Set read only mode. */
    EFM_SetOperateMode(EFM_MODE_READONLY);

    return enRet;
}

/**
 * @brief  Flash single program word with read back.
 * @param  [in] u32Addr                   The specified program address.
 * @param  [in] u32Data                   The specified program data.
 * @retval An en_result_t enumeration value:
 *           - Ok: program success
 *           - Error: program error
 *           - ErrorTimeout: program error timeout
 */
en_result_t EFM_ProgramWordRB(uint32_t u32Addr, uint32_t u32Data)
{
    en_result_t enRet = Ok;
    uint16_t u16tmp = 0u;

    DDL_ASSERT(IS_VALID_EFM_ADDR(u32Addr));

    /* CLear the error flag. */
    EFM_ClearFlag(EFM_FLAG_CLR_PEWERRCLR    | EFM_FLAG_CLR_PEPRTERRCLR |
                  EFM_FLAG_CLR_PGMISMTCHCLR | EFM_FLAG_CLR_OPTENDCLR   |
                  EFM_FLAG_CLR_COLERRCLR);

    /* Set single program mode. */
    EFM_SetOperateMode(EFM_MODE_PROGRAMREADBACK);
    /* program data. */
    *(uint32_t*)u32Addr = u32Data;

    while(Set != EFM_GetFlagStatus(EFM_FLAG_RDY))
    {
        u16tmp ++;
        if(u16tmp > EFM_TIMEOUT)
        {
            enRet = ErrorTimeout;
        }
    }

    if(Set == EFM_GetFlagStatus(EFM_FLAG_PGMISMTCHERR))
    {
        /* clear flag PGMISMTCH */
        EFM_ClearFlag(EFM_FLAG_CLR_PGMISMTCHCLR);
        enRet = Error;
    }

    EFM_ClearFlag(EFM_FLAG_CLR_OPTENDCLR);
    /* Set read only mode. */
    EFM_SetOperateMode(EFM_MODE_READONLY);

    return enRet;
}

/**
 * @brief  Flash single program half word with read back.
 * @param  [in] u32Addr                   The specified program address.
 * @param  [in] u16Data                   The specified program data.
 * @retval An en_result_t enumeration value:
 *           - Ok: program success
 *           - Error: program error
 *           - ErrorTimeout: program error timeout
 */
en_result_t EFM_ProgramHalfWordRB(uint32_t u32Addr, uint16_t u16Data)
{
    en_result_t enRet = Ok;
    uint16_t u16tmp = 0u;

    DDL_ASSERT(IS_VALID_EFM_ADDR(u32Addr));

    /* CLear the error flag. */
    EFM_ClearFlag(EFM_FLAG_CLR_PEWERRCLR    | EFM_FLAG_CLR_PEPRTERRCLR |
                  EFM_FLAG_CLR_PGMISMTCHCLR | EFM_FLAG_CLR_OPTENDCLR   |
                  EFM_FLAG_CLR_COLERRCLR);

    /* Set single program mode. */
    EFM_SetOperateMode(EFM_MODE_PROGRAMREADBACK);
    /* program data. */
    *((volatile uint16_t*)u32Addr) = u16Data;

    while(Set != EFM_GetFlagStatus(EFM_FLAG_RDY))
    {
        u16tmp ++;
        if(u16tmp > EFM_TIMEOUT)
        {
            enRet = ErrorTimeout;
        }
    }

    if(Set == EFM_GetFlagStatus(EFM_FLAG_PGMISMTCHERR))
    {
        /* clear flag PGMISMTCH */
        EFM_ClearFlag(EFM_FLAG_CLR_PGMISMTCHCLR);
        enRet = Error;
    }

    EFM_ClearFlag(EFM_FLAG_CLR_OPTENDCLR);
    /* Set read only mode. */
    EFM_SetOperateMode(EFM_MODE_READONLY);

    return enRet;
}

/**
 * @brief  Flash single program byte with read back.
 * @param  [in] u32Addr                   The specified program address.
 * @param  [in] u8Data                    The specified program data.
 * @retval An en_result_t enumeration value:
 *           - Ok: program success
 *           - Error: program error
 *           - ErrorTimeout: program error timeout
 */
en_result_t EFM_ProgramByteRB(uint32_t u32Addr, uint8_t u8Data)
{
    en_result_t enRet = Ok;
    uint16_t u16tmp = 0u;

    DDL_ASSERT(IS_VALID_EFM_ADDR(u32Addr));

    /* CLear the error flag. */
    EFM_ClearFlag(EFM_FLAG_CLR_PEWERRCLR    | EFM_FLAG_CLR_PEPRTERRCLR |
                  EFM_FLAG_CLR_PGMISMTCHCLR | EFM_FLAG_CLR_OPTENDCLR   |
                  EFM_FLAG_CLR_COLERRCLR);

    /* Set single program mode. */
    EFM_SetOperateMode(EFM_MODE_PROGRAMREADBACK);
    /* program data. */
    *((volatile uint8_t*)u32Addr) = u8Data;

    while(Set != EFM_GetFlagStatus(EFM_FLAG_RDY))
    {
        u16tmp ++;
        if(u16tmp > EFM_TIMEOUT)
        {
            enRet = ErrorTimeout;
        }
    }

    if(Set == EFM_GetFlagStatus(EFM_FLAG_PGMISMTCHERR))
    {
        /* clear flag PGMISMTCH */
        EFM_ClearFlag(EFM_FLAG_CLR_PGMISMTCHCLR);
        enRet = Error;
    }

    EFM_ClearFlag(EFM_FLAG_CLR_OPTENDCLR);
    /* Set read only mode. */
    EFM_SetOperateMode(EFM_MODE_READONLY);

    return enRet;
}

/**
 * @brief  Flash sequence program.
 * @param  [in] u32Addr                   The specified program address.
 * @param  [in] u32Len                    The len of specified program data.
 * @param  [in] *pBuf                     The pointer of specified program data.
 * @retval An en_result_t enumeration value:
 *           - Ok: program success
 *           - ErrorTimeout: program error timeout
 */
en_result_t EFM_SequenceProgram(uint32_t u32Addr, uint32_t u32Len, void *pBuf)
{
    en_result_t enRet = Ok;
    uint16_t u16tmp = 0u;
    uint32_t *u32pSrc = pBuf;
    uint32_t *u32pDest = (uint32_t *)u32Addr;
    uint32_t u32LoopWords = u32Len >> 2ul;
    uint32_t u32RemainBytes = u32Len % 4ul;

    DDL_ASSERT(IS_VALID_EFM_ADDR(u32Addr));
    DDL_ASSERT(IS_VALID_POINTER(pBuf));

    /* CLear the error flag. */
    EFM_ClearFlag(EFM_FLAG_CLR_PEWERRCLR    | EFM_FLAG_CLR_PEPRTERRCLR |
                  EFM_FLAG_CLR_PGMISMTCHCLR | EFM_FLAG_CLR_OPTENDCLR   |
                  EFM_FLAG_CLR_COLERRCLR);

    /* Set sequence program mode. */
    EFM_SetOperateMode(EFM_MODE_PROGRAMSEQUENCE);

    /* program data. */
    while(u32LoopWords--)
    {
        *u32pDest++ = *u32pSrc++;
        /* wait operate end. */
        while(Set != EFM_GetFlagStatus(EFM_FLAG_OPTEND))
        {
            u16tmp++;
            if(u16tmp > EFM_TIMEOUT)
            {
                enRet = ErrorTimeout;
            }
        }
        /* clear end flag. */
        EFM_ClearFlag(EFM_FLAG_CLR_OPTENDCLR);
    }
    if(u32RemainBytes)
    {
        uint8_t *u8pDest = (uint8_t*)u32pDest;
        uint8_t *u8pSrc = (uint8_t*)u32pSrc;
        while(u32RemainBytes--)
        {
            *u8pDest++ = *u8pSrc++;
        }
    }

    /* Set read only mode. */
    EFM_SetOperateMode(EFM_MODE_READONLY);

